tap "codecrafters-io/tap"
tap "gromgit/brewtils"
tap "jesseduffield/lazygit"
tap "radulucut/cleed"
tap "sst/tap"
tap "xcodesorg/made"
# Download with resuming and segmented downloading
brew "aria2"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interactive GPU process monitor
brew "nvtop"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install various Ruby versions and implementations
brew "ruby-build"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-platform application to monitor your network traffic
brew "sniffnet"
# Generate type safe Go from SQL
brew "sqlc"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift toolchain installer and manager
brew "swiftly"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Plain text note-taking assistant
brew "zk"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# Install and switch between multiple versions of Xcode
brew "xcodesorg/made/xcodes"
# Application launcher and productivity software
cask "alfred"
# Local-first and end-to-end encrypted notes app
cask "anytype"
# Universal chat app powered by Matrix
cask "beeper"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Reclaim storage used for Xcode caches
cask "devcleaner"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
# Waterfall-style image viewer
cask "flowvision"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
# GIT client
cask "fork"
# 2D and 3D game engine
cask "godot"
# Free and open-source media player
cask "iina"
# JetBrains tools manager
cask "jetbrains-toolbox"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Minimal GUI for AI code agents
cask "t3-code"
# Messaging app with a focus on speed and security
cask "telegram"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Lossless audio decoder
cask "xld"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "jdinhlife.gruvbox"
vscode "kilocode.kilo-code"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mkhl.shfmt"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "shan.code-settings-sync"
vscode "sumneko.lua"
vscode "sweetpad.sweetpad"
vscode "swiftlang.swift-vscode"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-swiftformat"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
go "cmd/go"
go "cmd/gofmt"
cargo "cargo-deny"
cargo "crown"
cargo "rustlings"
cargo "taplo-cli"
npm "@earendil-works/pi-coding-agent"
npm "corepack"
npm "pi-obsidian-vault"
npm "pi-subagents"
npm "pi-web-access"
